
void book::setBookMem(char  *newBook){
	strcpy (book_author, newBook);
}

char * book::getBookAuthor(){
	return (book_author);
}

char menu::drawMenuMain (){

	char choice;
	cout << string(50, '\n');
	cout << "\033[2;1H";
	cout << "Оберіть потрібний пункт :" << "\n\n";
	cout << "1. Робота з книжками" << "\n";
	cout << "2. Робота з абітурієнтами"<< "\n";
	cout << "3. Видача/Повернення книжок" << "\n";
	cout << "4. Налаштування" << "\n";
	cout << "0. Завершення роботи з програмою" << "\n";
	cout << "--------------------------" << "\n";

	return getchar();
}

char menu::drawMenuBook (){

	cout << string(50, '\n');
	cout << "\033[2;1H";
	cout << "Робота з книжками :" << "\n\n";
	cout << "1. Перелік книжок" << "\n";
	cout << "2. Додати нову" << "\n";
	cout << "3. Видалити" << "\n";
	cout << "4. Змінити назву або автора" << "\n";
	cout << "5. Знайти книжку" << "\n";
	cout << "0. Вийти в головне меню" << "\n";
	cout << "--------------------------" << "\n";

	return getchar();
}

char menu::drawMenuAbiturient(){

	cout << string(50, '\n');
	cout << "\033[2;1H";
	cout << "Работа з абітурієнтами :" << "\n\n";
	cout << "1. Перелік абітурієнтів" << "\n";
	cout << "2. Додати абітурієнта" << "\n";
	cout << "3. Змінити інформацію" << "\n";
	cout << "4. Знайти" << "\n";
	cout << "0. Вийти в головне меню" << "\n";
	cout << "--------------------------" << "\n";

	return getchar();
}

char menu::drawMenuAbiWork (){

	cout << string(50, '\n');
	cout << "\033[2;1H";
	cout << "Видача/Повернення книжок :" << "\n\n";
	cout << "1. Перелік книжок" << "\n";
	cout << "2. Показати видані книжки" << "\n";
	cout << "3. Показати невидані книжки" << "\n";
	cout << "4. Видити книжку студенту" << "\n";
	cout << "5. Повернення книжки у бібліотеку" << "\n";
	cout << "6. Знайти інформацію про книжку" << "\n";
	cout << "7. Знайти інформацію про абітурієнта" << "\n";
	cout << "0. Вийти в головне меню" << "\n";
	cout << "--------------------------" << "\n";

	return getchar();
}
